@emerkle826 Sorry I haven't been able to test this until now.

I got this warning when using the new modules:

```
-/+ resource "google_secret_manager_secret_version" "main" {
      ~ create_time  = "2022-11-16T12:57:40.465164Z" -> (known after apply)
      ~ destroy_time = "" -> (known after apply)
      ~ id           = "projects/..." -> (known after apply)
      ~ name         = "projects/..." -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ secret_data  = (sensitive value) # forces replacement
      ~ version      = "5" -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```

Not sure if `secret_data` in `google_secret_manager_secret_version` is marked sensitive either way, so it doesn't matter?